#### `terraform plan` Success

<details><summary>Show Output</summary>

```diff

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # aws_cognito_resource_server.rojopolis_user_pool_resource_server will be created
+ resource "aws_cognito_resource_server" "rojopolis_user_pool_resource_server" {
      + id                = (known after apply)
      + identifier        = "https://api.rojopolis.com"
      + name              = "My 90 API"
      + scope_identifiers = (known after apply)
      + user_pool_id      = (known after apply)

      + scope {
          + scope_description = "Users can read agency resources"
          + scope_name        = "agency.read"
        }
      + scope {
          + scope_description = "Users can read questionResponses resources"
          + scope_name        = "questionResponses.read"
        }
    }

  # aws_cognito_user_pool.rojopolis_user_pool will be created
+ resource "aws_cognito_user_pool" "rojopolis_user_pool" {
      + arn                        = (known after apply)
      + creation_date              = (known after apply)
      + email_verification_message = (known after apply)
      + email_verification_subject = (known after apply)
      + endpoint                   = (known after apply)
      + id                         = (known after apply)
      + last_modified_date         = (known after apply)
      + mfa_configuration          = "OFF"
      + name                       = "rojopolis User Pool"

      + admin_create_user_config {
          + allow_admin_create_user_only = (known after apply)
          + unused_account_validity_days = (known after apply)

          + invite_message_template {
              + email_message = (known after apply)
              + email_subject = (known after apply)
              + sms_message   = (known after apply)
            }
        }

      + lambda_config {
          + create_auth_challenge          = (known after apply)
          + custom_message                 = (known after apply)
          + define_auth_challenge          = (known after apply)
          + post_authentication            = (known after apply)
          + post_confirmation              = (known after apply)
          + pre_authentication             = (known after apply)
          + pre_sign_up                    = (known after apply)
          + pre_token_generation           = (known after apply)
          + user_migration                 = (known after apply)
          + verify_auth_challenge_response = (known after apply)
        }

      + password_policy {
          + minimum_length    = (known after apply)
          + require_lowercase = (known after apply)
          + require_numbers   = (known after apply)
          + require_symbols   = (known after apply)
          + require_uppercase = (known after apply)
        }

      + schema {
          + attribute_data_type = "String"
          + mutable             = true
          + name                = "orgIds"

          + string_attribute_constraints {
              + max_length = "2048"
              + min_length = "0"
            }
        }

      + verification_message_template {
          + default_email_option  = (known after apply)
          + email_message         = (known after apply)
          + email_message_by_link = (known after apply)
          + email_subject         = (known after apply)
          + email_subject_by_link = (known after apply)
          + sms_message           = (known after apply)
        }
    }

  # aws_cognito_user_pool_client.rojopolis_user_pool_client will be created
+ resource "aws_cognito_user_pool_client" "rojopolis_user_pool_client" {
      + allowed_oauth_flows                  = [
          + "code",
          + "implicit",
        ]
      + allowed_oauth_flows_user_pool_client = true
      + allowed_oauth_scopes                 = (known after apply)
      + callback_urls                        = [
          + "https://staging.textrojopolis.com",
          + "https://secure.textrojopolis.com",
          + "http://localhost:6075",
        ]
      + client_secret                        = (known after apply)
      + explicit_auth_flows                  = [
          + "USER_PASSWORD_AUTH",
        ]
      + id                                   = (known after apply)
      + logout_urls                          = [
          + "https://localhost:6075",
        ]
      + name                                 = "rojopolis App Client"
      + refresh_token_validity               = 30
      + supported_identity_providers         = [
          + "COGNITO",
        ]
      + user_pool_id                         = (known after apply)
    }

  # aws_cognito_user_pool_domain.rojopolis_user_pool_domain will be created
+ resource "aws_cognito_user_pool_domain" "rojopolis_user_pool_domain" {
      + aws_account_id              = (known after apply)
      + cloudfront_distribution_arn = (known after apply)
      + domain                      = "rojopolis-179003522493"
      + id                          = (known after apply)
      + s3_bucket                   = (known after apply)
      + user_pool_id                = (known after apply)
      + version                     = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.
```

</details>

*Workflow: `Terraform`, Action: `terraform-plan-cognito`*